incompressibleCylinder/2Dcommon/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          2e-2;

writeControl    timeStep;

writeInterval   100;

purgeWrite      200;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{    
    forceCoeffs
    {
        type            forceCoeffs;
        libs   	        ("libforces.so");
        patches         (cylinder);
        writeControl    writeTime;
        
        rho             rhoInf;
        rhoInf          1;
        
        log             true;
        
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        
        magUInf         1;
        
        lRef            2;
        Aref            2;
    }
}

// ************************************************************************* //
